[
  {
    "title": "Yemen Port of Mokha Hayma Microlot",
    "review title": "Dragonfly Coffee Roasters",
    "review rating": "97",
    "Location": "Boulder, Colorado",
    "Origin": "Hayma, north-central Yemen",
    "Roast": "Medium",
    "Est. Price": "$85.00/8 ounces",
    "Review Date": "February 2017",
    "Agtron": "47/68",
    "Aroma": "10",
    "Acidity": "9",
    "Body": "9",
    "Flavor": "10",
    "Aftertaste": "9",
    "Blind Assessment": "Intricately layered, sweetly tart, harmoniously composed. Aromatic orchid, candied ginger, frankincense, Concord grape, roasted cacao nib in aroma and cup. Bright, juicy, fruit-toned acidity; elegant, satiny mouthfeel. The flavor-saturated finish fulfills the promise of the cup, amplifying all aroma and flavor notes in the short and introducing coconut tones in the long.",
    "Notes": "This exceptional coffee was selected as the No. 1 coffee on Coffee Reviews list of the Top 30 Coffees of 2017. Although Ethiopia is the botanical home of Coffea arabica, Yemen introduced the beverage to the rest of the world in the 16th and 17th centuries, and Yemeni coffee is still grown from ancient heirloom cultivars of arabica on stone-walled terraces ringing fortress-like mountaintop villages. All Yemen coffees are natural-processed, or dried in the whole fruit. This particular Yemen may owe its extravagant aromatics to ancient tree varieties, but its superb balance and vivacity is owing to the close-to-heroic work of importer and coffee developer Mokhtar Alkhanshali of Port of Mokha Coffee, who has worked with farmers to improve their picturesque but often haphazard harvesting and drying procedures, and who selects and meticulously transports microlots like this one to the U.S. Dragonfly Coffee is a Boulder, Colorado-based micro-roaster that produces high-quality coffees and supports worthy causes. Visit www.dragonflycoffeeroasters.com or call 303-579-2154 for more information.",
    "The Bottom Line": "An exquisitely composed Yemen coffee, almost other-worldly in its array of fruit and floral notes, all enveloped in a crisp chocolate."
  },
  {
    "title": "100% Kona SL-28",
    "review title": "Hula Daddy Kona Coffee",
    "review rating": "97",
    "Location": "Holualoa, Hawaii",
    "Origin": "Holualoa, North Kona growing district, Big Island of Hawaii",
    "Roast": "Medium-Light",
    "Est. Price": "$74.95/8 ounces",
    "Review Date": "November 2017",
    "Agtron": "56/78",
    "Aroma": "10",
    "Acidity/Structure": "9",
    "Body": "9",
    "Flavor": "10",
    "Aftertaste": "9",
    "Blind Assessment": "Spectacularly sweet and hugely aromatic. Meyer lemon marmalade, cedar, pistachio, guava, jasmine in aroma and cup. Crisply sweet/tart and massively juicy in structure; plush, buoyant mouthfeel. The juicy structure and complex aromatics persist in a long, lingering finish.   ",
    "Notes": "This exceptional coffee was selected as the No. 2 coffee on Coffee Reviews list of the Top 30 Coffees of 2017. Hula Daddy is a boutique coffee producer with farms at the 1,400 and 2,500 foot levels of the Mount Hualalai volcano near the northern end of the Kona growing district, five minutes above the town of Kailua-Kona. This coffee was produced entirely from trees of the distinguished SL-28 variety of Arabica, the most celebrated of the Bourbon-derived tree varieties responsible for Kenyas finest coffees. This SL-28 was grown at the higher elevation Hula Daddy farm and processed with the ferment step conducted dry (no water added to the tank) using a commercial yeast. It is a limited edition coffee only available for sale through the allocation list on the Hula Daddy website. Visit www.huladaddy.com or call 888-553-2339 for more information.",
    "The Bottom Line": "Coffee simply doesnt get much better than this. Transcendently classic."
  },
  {
    "title": "Ulos Batak Sumatra Peaberry",
    "review title": "JBC Coffee Roasters",
    "review rating": "97",
    "Location": "Madison, Wisconsin",
    "Origin": "Northern Sumatra, Indonesia",
    "Roast": "Medium-Light",
    "Est. Price": "$18.60/12 ounces",
    "Review Date": "January 2017",
    "Agtron": "57/76",
    "Aroma": "10",
    "Acidity": "9",
    "Body": "9",
    "Flavor": "10",
    "Aftertaste": "9",
    "Blind Assessment": "Intensely rich, complex, vast. Plumeria, chocolate fudge, white grapefruit, perique (fermented) pipe tobacco, white truffle in aroma and cup. Juicy, bright acidity; plush, syrupy mouthfeel. The resonant, flavor-saturated finish is long, balanced, and reiterates all of the tendencies in the cup sweet (plumeria, chocolate), tart (white grapefruit), savory (pipe tobacco, truffle).",
    "Notes": "This exceptional coffee was selected as the No. 3 coffee on Coffee Reviews list of the Top 30 Coffees of 2017. Coffees from the northern part of the Indonesian island of Sumatra are admired for their complex earth and fruit notes that appear to result largely from unorthodox fruit removal and drying practices called wet hulling. This is a splendid example of the potential of the type. This sample consists entirely of peaberries, a kind of bean that results when the coffee fruit develops only a single, oval bean rather than the usual pair of flat-sided beans. Peaberries produce a somewhat different (often better) cup than normal beans from the same crop, from which they may or may not be separated during grading. JBC Coffee Roasters vision is simple let the coffee lead the way through sourcing and roasting the best and most unique coffees available and rewarding the farmers who grow those coffees with substantial premiums.",
    "The Bottom Line": "An exquisite experience of Sumatra coffee"
  },
  {
    "title": "Kenya Kabare AA",
    "review title": "Revel Coffee",
    "review rating": "96",
    "Location": "Billings, Montana",
    "Origin": "South-central Kenya",
    "Roast": "Medium-Light",
    "Est. Price": "$14.50/12 ounces",
    "Review Date": "April 2017",
    "Agtron": "56/77",
    "Aroma": "9",
    "Acidity": "9",
    "Body": "9",
    "Flavor": "10",
    "Aftertaste": "9",
    "Blind Assessment": "Delicate, subtle, intricately vibrant. Honey, strawberry guava, lilac, roasted cacao nib, fine musk in aroma and cup. Buoyant, juicy acidity; lush, velvety mouthfeel. The finish is distinctive in its richly drying, yet flavor-saturated originality. All of the aroma and flavor notes from the cup are sustained in the short finish, and strawberry guava and lilac, in particular, persist far into the very long.",
    "Notes": "This exceptional coffee was selected as the No. 4 coffee on Coffee Reviews list of the Top 30 Coffees of 2017. Produced by the Kabare Cooperative from trees of the admired SL28 and SL34 varieties of Arabica. Despite challenges ranging from unclear government coffee policy and urban encroachment on prime coffee lands to chronically unstable weather, the famed Kenya coffee auction system and its participating cooperatives continue to produce some of the worlds most elegant and distinctive coffees. AA is the highest grade of Kenya coffee based on bean size and freedom from physical imperfections. Revel Coffee is a micro-roaster located in Billings, Montana. Its motto Quality is paramount  a difference you can revel in.",
    "The Bottom Line": "A commanding Kenya coffee"
  },
  {
    "title": "Ninety Plus Gesha Estates Limited Batch #227",
    "review title": "JBC Coffee Roasters",
    "review rating": "97",
    "Location": "Madison, Wisconsin",
    "Origin": "Chiriqui Province, far western Panama",
    "Roast": "Light",
    "Est. Price": "$68.50/4 ounces",
    "Review Date": "July 2017",
    "Agtron": "67/97",
    "Aroma": "10",
    "Acidity": "9",
    "Body": "9",
    "Flavor": "10",
    "Aftertaste": "9",
    "Blind Assessment": "Delicate yet deeply aromatic, gloriously and almost impossibly complex in its fruit and floral expression. Fruit ranges from grapefruit through lychee to passionfruit; flowers suggest lavender, rose, more. There is chocolate and a grapy Cognac reduction, and finally a savory resonance we called sweet mushroom. Juicy, floral-tart acidity; viscous, syrupy mouthfeel. The finish is laden with complex floral top-notes in the short, rounding to hints of sweet fruit and deep Cognac-toned chocolate in the long.",
    "Notes": "This exceptional coffee was selected as the No. 5 coffee on Coffee Reviews list of the Top 30 Coffees of 2017. This coffee is a collaboration between brothers Michael Johnson of JBC and Joseph Brodsky of Ninety Plus Coffee. It was produced entirely from trees of the celebrated Gesha variety of Arabica, and processed by a proprietary variation of the wet method in which the coffee fruit is subjected to fermentation and washing before drying. According to Brodsky, This particular process is a result of a discovery of specific bacteria that are locally present at Ninety Plus Gesha Estates that were observed to yield unique flavor when applied to Gesha. These bacteria were subsequently cultivated and applied in a controlled way to focus and enhance their impact in the fermentation process. Lot 227 is part of a series of coffees in 2017 (Jose Alfredo Gesha Series), of which all, in varying degrees, exhibit this unique flavor. Packaged in attractive and reusable decorative cans. JBC Coffee Roasters vision is simple let the coffee lead the way through sourcing and roasting the best and most unique coffees available and rewarding the farmers who grow those coffees with substantial premiums.",
    "The Bottom Line": "An extraordinarily original coffee, both in story (Gesha variety, unorthodox processing) and in its stunning aromatics, both intricately complex, yet grandly and resonantly complete."
  },
  {
    "title": "El Salvador Finca Kilimanjaro Cascara Fermentation Aida Batlle",
    "review title": "PT's Coffee Roasting",
    "review rating": "95",
    "Location": "Topeka, Kansas",
    "Origin": "Santa Ana Department, El Salvador",
    "Roast": "Medium",
    "Est. Price": "$35.00/12 ounces",
    "Review Date": "June 2017",
    "Agtron": "50/71",
    "Aroma": "9",
    "Acidity": "9",
    "Body": "9",
    "Flavor": "9",
    "Aftertaste": "9",
    "Blind Assessment": "Intensely sweet, intricate. Dark chocolate, aromatic orchid, strawberry guava, almond butter, frankincense in aroma and cup. Juicy, savory-sweet acidity; delicate, satiny mouthfeel. A bonus coconut note surfaces in the resonant, flavor-saturated finish.",
    "Notes": "This exceptional coffee was selected as the No. 6 coffee on Coffee Reviews list of the Top 30 Coffees of 2017. Finca Kilimanjaro is an El Salvador farm named after East Africas highest peak by Aida Batlle, one of El Salvadors (and Central Americas) most respected and innovative coffee producers. Finca Kilimanjaro is planted with the famous SL28 variety of Arabica, the variety that produces the finest coffees of Kenya. This particular lot was fermented in an infusion of cascara (dried husk of the coffee fruit). This coffee earned the top rating in a tasting of women-produced coffees for Coffee Reviews June 2017 tasting report. Roasted at PTs Coffee, where the motto is without the love, its just coffee. Visit www.ptscoffee.com or call 888-678-5282 for more information.",
    "The Bottom Line": "The originality of this sweetly intricate, multilayered cup is doubtless owing both to a distinguished tree variety  Kenyas famous SL28  as well as to an innovative processing wrinkle involving conducting the fermentation step in an infusion of cascara, or the dried husk of the coffee fruit.",
    "This review originally appeared in the June, 2017 tasting report": "Holding Up (More Than) Half The Sky"
  },
  {
    "title": "Panama Don Julian Pacamara",
    "review title": "Willoughby's Coffee & Tea",
    "review rating": "95",
    "Location": "Branford, Connecticut",
    "Origin": "Horcheta, Chiriqui Province, western Panama",
    "Roast": "Medium-Light",
    "Est. Price": "$49.99/16 ounces",
    "Review Date": "November 2017",
    "Agtron": "56/80",
    "Aroma": "9",
    "Acidity/Structure": "9",
    "Body": "9",
    "Flavor": "9",
    "Aftertaste": "9",
    "Blind Assessment": "Richly sweet/tart, crisply complex. Dark chocolate, roasted cashew, pink grapefruit, sandalwood, Chinese five-spice in aroma and cup. Structure is drying but sweetly juicy; buoyant and plump in mouthfeel. Nut-toned chocolate with a hint of sandalwood and spice saturate a sweet, richly dry finish. ",
    "Notes": "This exceptional coffee was selected as the No. 7 coffee on Coffee Reviews list of the Top 30 Coffees of 2017. Produced by Heakyung Kang Burneskis of Finca Don Julian in full rustic shade and processed by the traditional wet or washed method, in which skin and fruit flesh are removed from the beans or seeds before they are dried. This lot is comprised entirely of the much admired, bold-bean Pacamara variety of Arabica, a cross between the giant-beaned Maragogipe variety and Pacas, a selection of the heirloom Bourbon. Willoughbys Coffee & Tea is a pioneer specialty coffee roaster established in the early 1980s that has gracefully and successfully moved with the times and now offers a menu of extremely refined small-lot, single-origin coffees. Visit www.willoughbyscoffee.com or call 800-388-8400 for more information.",
    "The Bottom Line": "Superb Pacamara profile, crisply dry and spicy yet deeply, lavishly juicy sweet."
  },
  {
    "title": "Panama Auromar Geisha Natural",
    "review title": "Willoughby's Coffee & Tea",
    "review rating": "96",
    "Location": "Branford, Connecticut",
    "Origin": "Piedra Candela, Chiriqui Province, far western Panama",
    "Roast": "Medium-Light",
    "Est. Price": "$55.00/12 ounces",
    "Review Date": "December 2017",
    "Agtron": "56/80",
    "Aroma": "10",
    "Acidity/Structure": "9",
    "Body": "9",
    "Flavor": "9",
    "Aftertaste": "9",
    "Blind Assessment": "Complex, uniquely sweet, tropical. Plumeria, roasted cacao nib, mango, sandalwood, nougat in aroma and cup. Sweetly tart structure with bright, juicy acidity; syrupy mouthfeel. The finish carries through on the promise of the cup, with rich florals in the short and deep fruit notes in the long, where a new element, a soft fruit tone suggesting coconut, surfaces.",
    "Notes": "This exceptional coffee was selected as the No. 8 coffee on Coffee Reviews list of the Top 30 Coffees of 2017, and it earned the highest rating in a tasting of holiday coffees for Coffee Reviews December 2017 tasting report. Produced from trees of the rare Ethiopia-derived botanical variety Gesha (also Geisha) by farmer Roberto Brenes of Auromar Estate. With its generally elongated beans and distinctive floral and crisp, often chocolaty cup, the Gesha variety continues to distinguish itself as one of the worlds most unique coffees. This is a dry-processed or natural Gesha, meaning the beans were dried inside the fruit rather than after the fruit has been removed, as is the case with wet-processed or washed coffees. Willoughbys Coffee & Tea is a pioneer specialty coffee roaster established in the early 1980s that has gracefully and successfully moved with the times and now offers a menu of extremely refined small-lot, single-origin coffees. Visit www.willoughbyscoffee.com or call 800-388-8400 for more information.",
    "The Bottom Line": "A dynamic coffee with complex aromatics that invoke the tropicsand a seemingly infinite finish, richly sweet and flavor-saturated."
  },
  {
    "title": "Carmen Geisha El Palomar Best of Panama #4 Carlos Aguilera",
    "review title": "Dragonfly Coffee Roasters",
    "review rating": "96",
    "Location": "Boulder, Colorado",
    "Origin": "Boquete growing region, western Panama",
    "Roast": "Medium-Light",
    "Est. Price": "$50.00/8 ounces",
    "Review Date": "September 2017",
    "Agtron": "54/78",
    "Aroma": "9",
    "Acidity/Structure": "10",
    "Body": "9",
    "Flavor": "9",
    "Aftertaste": "9",
    "Blind Assessment": "Rich, lavish, elegantly sweet-tart and complexly layered. In aroma and cup, intricately expressed citrus (sweet lime, grapefruit, blood orange); spice (coriander, mace); lilac-like flowers; almond; cocoa. Grand but balanced in structure; plump and delicately syrupy in mouthfeel. Everything rounds and deepens in a flavor-saturated finish.",
    "Notes": "This exceptional coffee was selected as the No. 9 coffee on Coffee Reviews list of the Top 30 Coffees of 2017. This coffee also attracted the highest rating in a tasting of 20 coffees of the Geisha (also spelled Gesha) variety for Coffee Reviews September 2017 tasting report. First planted by Don Enrique Vasquez, who is said to have brought the now celebrated Gesha variety to Panama from Costa Rica in 1898, these trees grow on the slopes of Volcan de Baru in Boquete at elevations between 5,000 and 5,700 feet. With its generally elongated beans and distinctive floral and crisp, often chocolaty, cup, the Gesha continues to distinguish itself as one of the worlds most unique coffees. This is a wet-processed or washed version, meaning the fruit skin and pulp were removed from the beans immediately after harvesting and before drying. Exclusive to Dragonfly Coffee Roasters, which purchased this lot at the Best of Panama auction. Dragonfly Coffee is a Boulder, Colorado-based micro-roaster that produces high-quality coffees and supports worthy causes. Visit www.dragonflycoffeeroasters.com or call 303-579-2154 for more information.",
    "The Bottom Line": "Extraordinary shifting and intricate flavor and aroma supported by a flawless structure, classic in its sweet-tart balance.",
    "This review originally appeared in the September, 2017 tasting report": "Gesha Coffees 2017"
  },
  {
    "title": "100% Kona Bourbon Pointu Laurina",
    "review title": "Hula Daddy Kona Coffee",
    "review rating": "95",
    "Location": "Holualoa, Hawaii",
    "Origin": "Holualoa, North Kona growing district, Big Island of Hawaii",
    "Roast": "Medium-Light",
    "Est. Price": "$44.95/8 ounces",
    "Review Date": "November 2017",
    "Agtron": "52/76",
    "Aroma": "9",
    "Acidity/Structure": "9",
    "Body": "9",
    "Flavor": "9",
    "Aftertaste": "9",
    "Blind Assessment": "Sweet, deep, intense but balanced. Peach, maple syrup, sandalwood, grapefruit zest, almond, magnolia in aroma and cup. Round, resonantly and sweetly bright in structure. Silky and buoyant in mouthfeel. Deep, long, flavor-saturated finish.",
    "Notes": "This exceptional coffee was selected as the No. 10 coffee on Coffee Reviews list of the Top 30 Coffees of 2017. Bourbon Pointu, botanical name var. Laurina, is a rare variety of Arabica that is a natural mutation of the famous Bourbon variety first selected on Reunion Island in the Indian Ocean. The Bourbon Pointu is famous for its natural low levels of caffeine, bean shape (small and tending to be pointed at the ends, hence pointu), and pungently fruit-toned, Bourbon-like cup. This version was produced in Kona, Hawaii and processed with the ferment step conducted dry (no water added to the tank) using a commercial yeast. Hula Daddy is a boutique coffee producer with farms at the 1,400 and 2,500 foot levels of the Mount Hualalai volcano near the northern end of the Kona growing district, five minutes above the town of Kailua-Kona. This rare coffee is only available on the Hula Daddy website through their allocation list. Visit www.huladaddy.com or call 888-553-2339 for more information.",
    "The Bottom Line": "Intense, bright but balanced cup with layered aromatic intrigue generated by a celebrated and rare tree variety."
  },
  {
    "title": "Guatemala Finca Cappuccino Echo-Lot Espresso",
    "review title": "Kakalove Cafe",
    "review rating": "95",
    "Location": "Chia-Yi, Taiwan",
    "Origin": "Cobn region, Alta Verapaz Department, Guatemala",
    "Roast": "Medium-Light",
    "Est. Price": "NT $450/16 ounces",
    "Review Date": "March 2017",
    "Agtron": "50/74",
    "Aroma": "9",
    "Body": "9",
    "Flavor": "9",
    "Aftertaste": "9",
    "With Milk": "9",
    "Blind Assessment": "Evaluated as espresso. Deeply floral, chocolate-toned. Wisteria-like flowers, ripe passion fruit, dark chocolate, blood orange zest, frankincense in aroma and small cup. Lively, silky-smooth mouthfeel; resonant, flavor-saturated finish. In three parts milk, the floral and chocolate notes are particularly amplified in harmonious balance. ",
    "Notes": "This exceptional coffee was selected as the No. 11 coffee on Coffee Reviews list of the Top 30 Coffees of 2017. Kakalove Caf is a nano-roaster located in the small city of Chia-Yi in Taiwan that strives to procure and roast the finest quality coffee. Visit www.kakalovecafe.com.tw or email kahiyuho@gmail.com for more information.",
    "The Bottom Line": "A deeply rich, sweet-tart shot, driven by floral and dark chocolate; lush and inviting in milk."
  },
  {
    "title": "Rwanda Bufcafe",
    "review title": "JBC Coffee Roasters",
    "review rating": "95",
    "Location": "Madison, Wisconsin",
    "Origin": "Nyamagabe district, Southern Province,Rwanda",
    "Roast": "Medium-Light",
    "Est. Price": "$17.25/12 ounces",
    "Review Date": "January 2017",
    "Agtron": "54/78",
    "Aroma": "9",
    "Acidity": "9",
    "Body": "9",
    "Flavor": "9",
    "Aftertaste": "9",
    "Blind Assessment": "Crisply sweet, intricately layered. Grapefruit, cocoa nib, honeysuckle, white sage, a suggestion of wild mushroom in aroma and cup. Juicy, balanced acidity; velvety-smooth mouthfeel. The sweet-savory finish is flavor-saturated, leading with fruit and floral tones in the short and culminating in umami-toned intrigue with hints of white sage and wild mushroom.",
    "Notes": "This exceptional coffee was selected as the No. 12 coffee on Coffee Reviews list of the Top 30 Coffees of 2017. Produced from trees of the Bourbon variety of Arabica. Epiphanie Mukashyaka established the now famous Bufcafe washing station or wet mill following the Rwandan genocide and the loss of most of her family. She and her son now operate two wet mills and a dry mill in the area. Processed by the conventional wet or washed method, in which skin and fruit flesh are removed from the beans or seeds before they are dried. JBC Coffee Roasters vision is simple let the coffee lead the way through sourcing and roasting the best and most unique coffees available and rewarding the farmers who grow those coffees with substantial premiums.",
    "The Bottom Line": "One of the most impressive Rwanda coffees to have reached our cupping table in years"
  },
  {
    "title": "Flight Seasonal Espresso",
    "review title": "Red Rooster Coffee Roaster",
    "review rating": "95",
    "Location": "Floyd, Virginia",
    "Origin": "Colombia, Ethiopia, Kenya",
    "Roast": "Medium-Light",
    "Est. Price": "$16.49/12 ounces",
    "Review Date": "October 2017",
    "Agtron": "56/80",
    "Aroma": "9",
    "Body": "9",
    "Flavor": "9",
    "Aftertaste": "9",
    "With Milk": "9",
    "Blind Assessment": "Evaluated as espresso. Raspberry jam, juniper, dark chocolate, candied tangerine zest, tea rose in aroma and small cup. Lively, syrupy body; flavor-saturated, resonant finish. In cappuccino-scaled milk, notes of raspberry, chocolate, spicy florals, and sweet-toned citrus zest harmonize with balanced complexity.",
    "Notes": "This exceptional coffee was selected as the No. 13 coffee on Coffee Reviews list of the Top 30 Coffees of 2017. A seasonal espresso blend comprised of Colombia Adolfo Isoto, Colombia La Guamera, Ethiopia Telamo and Kenya AA Nyeri Kiruga coffees. Established in 2010, Red Rooster is an organic-certified micro-roaster focusing on socially conscious coffee and high-quality coffee. Visit redroostercoffee.com or call 540-745-7338 for more information.",
    "The Bottom Line": "A tour-de-force espresso composed of a fruit-driven, spice-toned blend of Colombia, Ethiopia and Kenya coffees"
  },
  {
    "title": "Papua New Guinea PB Kimel Estate",
    "review title": "Park Avenue Coffee",
    "review rating": "94",
    "Location": "St. Louis, MIssouri",
    "Origin": "Waghi Valley, Western Highlands Province, Papua New Guinea",
    "Roast": "Medium-Light",
    "Est. Price": "$17.49/16 ounces",
    "Review Date": "February 2017",
    "Agtron": "56/70",
    "Aroma": "9",
    "Acidity": "9",
    "Body": "8",
    "Flavor": "9",
    "Aftertaste": "9",
    "Blind Assessment": "Sweetly tart, delicately spicy. Pomegranate, cocoa nib, brown sugar, clove, grapefruit blossom in aroma and cup. Big, juicy, sweet-tart acidity; crisp, velvety mouthfeel. All aroma and flavor notes carry harmoniously into a resonant, flavor-saturated finish.",
    "Notes": "This exceptional coffee was selected as the No. 14 coffee on Coffee Reviews list of the Top 30 Coffees of 2017. Founded in 1974 by Australian Bobby Gibbs, Kimel Plantation is now owned and operated by traditional landowners, including over 400 families, many of them indigenous Opais people. The high mountain valleys of central Papua New Guinea offer some of the worlds most favorable terroirs for production of fine coffee, although the rugged terrain presents daunting transportation and infrastructure challenges. This sample consists entirely of peaberries, a kind of bean that results when the coffee fruit develops only a single, oval bean rather than the usual pair of flat-sided beans. Peaberries produce a somewhat different (often better) cup than normal beans from the same crop, from which they may or may not be separated during grading. This coffee tied for the top rating in a cupping of coffees from roasting companies five-years-old or younger for Coffee Reviews February 2017 tasting report. Park Avenue Coffee operates four cafes and a roasting facility in St. Louis, Missouri. Visit www.parkavenuecoffee.com for more information.",
    "The Bottom Line": "A particularly elegant Papua New Guinea peaberry coffee",
    "This review originally appeared in the February, 2017 tasting report": "New Roasting Companies Carry the Third-Wave Torch"
  },
  {
    "title": "Colombia La Palma and El Tucan Espresso",
    "review title": "Kakalove Cafe",
    "review rating": "94",
    "Location": "Chia-Yi, Taiwan",
    "Origin": "Cundinamarca Department, central Colombia",
    "Roast": "Medium-Light",
    "Est. Price": "NT $500/16 ounces",
    "Review Date": "May 2017",
    "Agtron": "51/72",
    "Aroma": "9",
    "Body": "9",
    "Flavor": "9",
    "Aftertaste": "8",
    "With Milk": "9",
    "Blind Assessment": "Evaluated as espresso. Richly and roundly bright; chocolaty and floral. Guava, tangerine, dark chocolate, sandalwood, lily in aroma and small cup. Smooth, silky-satiny mouthfeel; dry though flavor-saturated finish. Flowers, sweetly tart fruit and chocolate all carry with rich authority into three parts milk.",
    "Notes": "This exceptional coffee was selected as the No. 15 coffee on Coffee Reviews list of the Top 30 Coffees of 2017. Produced by Olga Beltran of La Palma & El Tucan, an innovative, quality- and sustainability-focused Colombia producer. Kakalove Caf is a nano-roaster located in the small city of Chia-Yi in Taiwan that strives to procure and roast the finest quality coffee. Visit www.kakalovecafe.com.tw or email kahiyuho@gmail.com for more information.",
    "The Bottom Line": "A bright yet lush straight shot that expresses its complexity with particular conviction in cappuccino-sized milk."
  },
  {
    "title": "El Salvador Finca Kilimanjaro",
    "review title": "Bird Rock Coffee Roasters",
    "review rating": "95",
    "Location": "San Diego, California",
    "Origin": "Santa Ana Department, El Salvador",
    "Roast": "Medium-Light",
    "Est. Price": "$25.00/12 ounces",
    "Review Date": "December 2017",
    "Agtron": "56/80",
    "Aroma": "9",
    "Acidity/Structure": "9",
    "Body": "9",
    "Flavor": "9",
    "Aftertaste": "9",
    "Blind Assessment": "High-toned, richly sweet. Strawberry guava, roasted cacao nib, lime zest, jasmine, almond in aroma and cup. Sweetly-tart structure with juicy, balanced acidity; plush, syrupy mouthfeel. The finish is long and resonant, with lime zest and strawberry guava in the short, rounding to cocoa-toned jasmine in the deeply sweet long.",
    "Notes": "This exceptional coffee was selected as the No. 16 coffee on Coffee Reviews list of the Top 30 Coffees of 2017, and it tied for the second-highest rating in a tasting of holiday coffees for Coffee Reviews December 2017 tasting report. Finca Kilimanjaro is an El Salvador farm named after East Africas highest peak by Aida Batlle, one of El Salvadors (and Central Americas) most respected and innovative coffee producers. Finca Kilimanjaro is planted with the famous SL28 variety of Arabica, the variety that produces the finest coffees of Kenya. This a dry-processed or natural coffee, meaning the beans were dried inside the fruit rather than after the fruit has been removed, as is the case with wet-processed or washed coffees. Based in the San Diego area, Bird Rock Coffee Roasters is a retailer and wholesaler focused on organic and socially responsible coffees; it was awarded the 2012 Micro-Roaster of the Year title from Roast Magazine. Visit www.birdrockcoffee.com or call 858-551-1707 for more information.",
    "The Bottom Line": "A graceful, generously fruit- and floral-toned El Salvador cup with an exceptionally balanced structure and juicy acidity."
  },
  {
    "title": "Ethiopia Sidama",
    "review title": "Reunion Island Coffee",
    "review rating": "94",
    "Location": "Oakville, Ontario, Canada",
    "Origin": "Sidama (also Sidamo) growing region, southern Ethiopia",
    "Roast": "Medium",
    "Est. Price": "CAD $17.00/12 ounces",
    "Review Date": "November 2017",
    "Agtron": "47/72",
    "Aroma": "9",
    "Acidity/Structure": "9",
    "Body": "9",
    "Flavor": "9",
    "Aftertaste": "8",
    "Blind Assessment": "Balanced, sweet-savory. Red currant, roasted cacao nib, clove, blood orange zest, frankincense in aroma and cup. Savory-sweet structure with lively acidity; syrupy mouthfeel. The resonant, spice-toned finish leads with intimations of clove and roasted cacao nib in the short, rounding to rich fruit tones with hints of frankincense in the long.",
    "Notes": "This exceptional coffee was selected as the No. 17 coffee on Coffee Reviews list of the Top 30 Coffees of 2017. This coffee also tied for the highest rating in a tasting of 71 organic-certified coffees from Africa for Coffee Reviews November 2017 tasting report. Southern Ethiopia coffees like this one are produced from distinctive traditional Ethiopian varieties of Arabica long grown in the region. Like virtually all southern Ethiopia coffees, this coffee is produced by villagers on small garden plots interplanted with food and other subsistence crops. This lot was processed by the wet or washed method (fruit skin and pulp are removed before drying). Organic and Fair Trade certified, the latter meaning they were purchased from small-holding farmers at a fair or economically sustainable price. Reunion Island Coffee is a quality-oriented roasting company founded by Canadian specialty coffee veteran Peter Pesce. Visit www.reunionislandcoffee.com or call 800-565-5950 for more information.",
    "The Bottom Line": "An elegantly expressive, fruit-forward but savory-leaning Ethiopia cup.",
    "This review originally appeared in the November, 2017 tasting report": "Organic-Certified Coffees from Africa"
  },
  {
    "title": "Aged Sumatra Ulos Batak Peaberry",
    "review title": "Equator Coffees & Teas",
    "review rating": "94",
    "Location": "San Rafael, California",
    "Origin": "Dolok Sanggul, Lintong growing region, North Sumatra, Indonesia",
    "Roast": "Medium-Light",
    "Est. Price": "$18.00/12 ounces",
    "Review Date": "May 2017",
    "Agtron": "53/73",
    "Aroma": "9",
    "Acidity": "9",
    "Body": "9",
    "Flavor": "9",
    "Aftertaste": "8",
    "Blind Assessment": "Complexly structured; tart, sweet-savory, balanced. Mango, cedar, molasses, fresh pipe tobacco, grapefruit zest in aroma and cup. Gently crisp acidity; plush, syrupy mouthfeel. Tobacco, cedar and the mango-like fruit carry into a quiet finish.",
    "Notes": "This exceptional coffee was selected as the No. 18 coffee on Coffee Reviews list of the Top 30 Coffees of 2017. An unusual coffee in several respects. Coffees like this one from the northern part of the Indonesian island of Sumatra are valued for their complex earth and fruit notes that appear to result largely from unorthodox fruit removal and drying practices called wet hulling. This is a particularly refined example of the type. In addition, this coffee was subjected to a deliberate aging process by being held for three years in a specialized warehouse in Singapore. This sample consists entirely of peaberries, a kind of bean that results when the coffee fruit develops only a single, oval bean rather than the usual pair of flat-sided beans. Peaberries produce a somewhat different (often better) cup than normal beans from the same crop, from which they may or may not be separated during grading.This coffee tied for the highest rating in a cupping of aged, casked and specially cured coffees forCoffee Reviews May 2017 tasting report.Founded in 1995, Equator Coffees & Teas is a women-owned wholesale coffee roasting company that focuses on sustainability in coffee-sourcing and business practices. Visit www.equatorcoffees.com or call 800-809-7687 for more information.",
    "The Bottom Line": "The great wet-hulled Sumatra profile takes on a particularly graceful resonance in this traditionally aged version.",
    "This review originally appeared in the May, 2017 tasting report": "Aged, Casked and Cured"
  },
  {
    "title": "Nicaragua Un Regalo de Dios Bourbon",
    "review title": "Giv COFFEE",
    "review rating": "94",
    "Location": "Torrington, Connecticut",
    "Origin": "Nueva Segovia growing region, Nicaragua",
    "Roast": "Medium-Light",
    "Est. Price": "$16.99/12 ounces",
    "Review Date": "October 2017",
    "Agtron": "56/81",
    "Aroma": "9",
    "Acidity/Structure": "9",
    "Body": "9",
    "Flavor": "9",
    "Aftertaste": "8",
    "Blind Assessment": "Delicate, balanced, sweetly spice-toned. Strawberry, almond, cocoa powder, fine musk, narcissus-like flowers in aroma and cup. Integrated, juicy, balanced structure. Velvety, lively, almost effervescent mouthfeel. The resonant, flavor-saturated finish leads with notes of sweet berries in the short, rounding to deep florals in the long.",
    "Notes": "This exceptional coffee was selected as the No. 19 coffee on Coffee Reviews list of the Top 30 Coffees of 2017. This coffee also tied for the highest rating in a tasting of 55 Nicaragua coffees for Coffee Reviews October 2017 tasting report. Produced by Luis Alberto entirely from trees of the old and admired Bourbon variety of Arabica. Processed by the wet or washed method (fruit skin and pulp are removed before drying). Giv COFFEE is dedicated to three goals to provide quality coffee, to provide a fair price to farmers, and to give back to those in need. Giv COFFEE donates two dollars of every retail bag of coffee it sells.",
    "The Bottom Line": "A confident floral and sweetly spice-toned Nicaragua from trees of the heirloom Bourbon variety",
    "This review originally appeared in the October, 2017 tasting report": "The New Nicaragua"
  },
  {
    "title": "Kenya Riakiberu AB",
    "review title": "Cimarron Coffee Roasters",
    "review rating": "95",
    "Location": "Montrose, Colorado",
    "Origin": "Muranga District, central Kenya",
    "Roast": "Medium-Light",
    "Est. Price": "$14.00/250 grams",
    "Review Date": "December 2017",
    "Agtron": "55/77",
    "Aroma": "9",
    "Acidity/Structure": "9",
    "Body": "9",
    "Flavor": "9",
    "Aftertaste": "9",
    "Blind Assessment": "Complex, balanced, floral-toned. Magnolia, tamarind, dark chocolate, molasses, papaya in aroma and cup. Sweet-savory structure with crisp, juicy acidity. The intricately layered finish leads with sweet-spicy floral notes, crescendoing to fruit (tamarind, papaya) in the long, with dark chocolate notes throughout.",
    "Notes": "This exceptional coffee was selected as the No. 20 coffee on Coffee Reviews list of the Top 30 Coffees of 2017, and it tied for the second-highest rating in a tasting of holiday coffees for Coffee Reviews December 2017 tasting report. Produced by the Kamacharia Farmers Cooperative Society from trees of the admired Bourbon-derived SL28 variety of Arabica. Despite grower discontent and urban encroachment on prime coffee lands, Kenya continues to produce some of the worlds most elegant and distinctive coffees. Cimarron Coffee Roasters is a micro-roaster on the Western Slope of Colorado that aims to offer sweet, clean, affordable and sustainable coffee. Roast profiles are developed for each coffee to highlight the inherently distinctive properties of each lot. Shipping is included in the coffee price. Visit www.cimarronroasters.com for more information.",
    "The Bottom Line": "A beautifully composed classic Kenya cup, with bright and deeply sweet fruit notes, big florals, solid chocolate and a hint of floral-toned spice."
  },
  {
    "title": "Finca El Obraje Colombia Gesha",
    "review title": "Amavida Coffee and Tea",
    "review rating": "95",
    "Location": "Santa Rosa Beach, Florida",
    "Origin": "Narino Department, southern Colombia",
    "Roast": "Medium",
    "Est. Price": "$29.95/6 ounces",
    "Review Date": "August 2017",
    "Agtron": "46/64",
    "Aroma": "9",
    "Acidity/Structure": "9",
    "Body": "9",
    "Flavor": "9",
    "Aftertaste": "9",
    "Blind Assessment": "This exceptional coffee was selected as the No. 21 coffee on Coffee Reviews list of the Top 30 Coffees of 2017. Produced from trees of the rare Ethiopia-derived botanical variety Gesha (also spelled Geisha) by Pablo Guerrero. With its generally elongated beans and distinctive floral and crisp, often chocolaty cup, the Gesha variety continues to distinguish itself as one of the worlds most unique coffees. This is a wet-processed or washed version, meaning the fruit skin and pulp were removed from the beans immediately after harvesting and before drying. The majority of Gesha coffees are grown in the Boquete region of Panama, but there is increased experimentation with this variety throughout Latin America, especially Colombia, where this exceptional version was grown. It attracted the highest rating in a tasting of nearly 130 darker-roasted coffees for Coffee Reviews August 2017 tasting report. The company name Amavida combines the Spanish words for love and life, reflecting Amavidas multifaceted commitment to fairness and fine coffee. Visit www.amavida.com or call 850-213-1965 for more information.",
    "Notes": "Round, crisp but simultaneously deep, complexly layered. Lemon zest, bakers chocolate, plumeria, incense-like myrrh note in aroma and cup. Balanced in structure resonant, sweetly tart acidity with a savory edge. Satiny mouthfeel. Flavor consolidates around floral notes in a long, resonant finish.",
    "The Bottom Line": "The slightly darker roast is felt rather than tasted in this extraordinarily deeply stated, complete version of the great Gesha profile. Those who may enjoy the aromatic extravagance of the Gesha profile but put off by Geshas often brightly assertive acidity should particularly value this rounder, yet still exhilaratingly vibrant version.",
    "This review originally appeared in the August, 2017 tasting report": "Darker-Roasted Coffees"
  },
  {
    "title": "Geisha Panama Santamaria Natural",
    "review title": "Campos Coffee",
    "review rating": "95",
    "Location": "Newtown, Sydney, Australia",
    "Origin": "Paso Ancho, Volcan, western Panama",
    "Roast": "Medium-Light",
    "Est. Price": "AUD $48.00/200 grams",
    "Review Date": "November 2017",
    "Agtron": "54/78",
    "Aroma": "9",
    "Acidity/Structure": "9",
    "Body": "9",
    "Flavor": "10",
    "Aftertaste": "8",
    "Blind Assessment": "Crisply sweet, intricate, delicately rich. Jasmine, tangerine zest, sandalwood, sweet ripe banana, roasted cacao nib in aroma and cup. Balanced, roundly and gracefully sweet/tart in structure. Light-footed and plush in mouthfeel. Flavor consolidates around jasmine, sandalwood and banana in a sweet, lasting finish.",
    "Notes": "This exceptional coffee was selected as the No. 22 coffee on Coffee Reviews list of the Top 30 Coffees of 2017. With its generally elongated beans and distinctive floral and crisp, often chocolaty cup, the Gesha (also Geisha) variety continues to distinguish itself as one of the worlds most unique coffees. This a dry-processed or natural coffee, meaning the beans were dried inside the fruit rather than after the fruit has been removed, as is the case with wet-processed or washed coffees. It was produced by farmer Edwin Santamaria, and took third place in the 2017 Best of Panama green coffee competition in the Geisha Natural category. Campos Coffee is committed to sourcing the finest coffees, with a focus on ethical and sustainable practices. Campos has locations in New South Wales, Victoria and Queensland, as well as Park City and Salt Lake City, Utah. For more information, visit www.camposcoffee.com.",
    "The Bottom Line": "Both elegantly balanced and subtly grand in detail; a quietly spectacular rendition of the Gesha profile."
  },
  {
    "title": "Washed Ethiopia Yirgacheffe Banko Gotiti",
    "review title": "Green Stone Coffee",
    "review rating": "95",
    "Location": "Taipei, Taiwan",
    "Origin": "Kochere, Yirgacheffe growing region, south-central Ethiopia",
    "Roast": "Medium-Light",
    "Est. Price": "NT $550/8 ounces",
    "Review Date": "August 2017",
    "Agtron": "58/82",
    "Aroma": "9",
    "Acidity/Structure": "9",
    "Body": "9",
    "Flavor": "10",
    "Aftertaste": "8",
    "Blind Assessment": "Subtly intricate, deeply sweet. Star jasmine, roasted cacao nib, dried mango, myrrh, fresh spearmint in aroma and cup. Bright, juicy acidity; plush, velvety mouthfeel. The resonant, flavor-saturated finish leads with notes of star jasmine and dried mango, balanced by suggestions of crisp cocoa tones throughout.",
    "Notes": "This exceptional coffee was selected as the No. 23 coffee on Coffee Reviews list of the Top 30 Coffees of 2017. Southern Ethiopia coffees like this one are produced from distinctive traditional Ethiopian varieties of Arabica long grown in the region. Like virtually all southern Ethiopia coffees, this coffee is produced by villagers on small garden plots interplanted with food and other subsistence crops. Processed by the wet or washed method (fruit skin and pulp are removed before drying). Green Stone Coffee is a woman-owned artisan roastery in Taipei, founded in 2016 and specializing in sourcing distinctive coffees that express their individual terroirs.",
    "The Bottom Line": "An elegant, crisply high-toned, floral-driven washed Yirgacheffe with a cocoa throughline."
  },
  {
    "title": "Static Amaro Gayo Natural Ethiopia",
    "review title": "Espresso Republic",
    "review rating": "95",
    "Location": "Chino, California",
    "Origin": "Yirgacheffe growing region, southern Ethiopia",
    "Roast": "Medium",
    "Est. Price": "$17.00/12 ounces",
    "Review Date": "September 2017",
    "Agtron": "45/61",
    "Aroma": "9",
    "Acidity/Structure": "9",
    "Body": "9",
    "Flavor": "9",
    "Aftertaste": "9",
    "Blind Assessment": "Crisply sweet, fruit-forward. Ripe strawberry, aromatic orchid, honey, toasted pine nut, a hint of sumac spice in aroma and cup. Lavish, elegant structure, with sweet-tart-savory in harmonious balance. Syrupy mouthfeel. The finish is resonant, long and flavor-saturated, maintaining the promise of the complex flavor notes from the cup.",
    "Notes": "This exceptional coffee was selected as the No. 24 coffee on Coffee Reviews list of the Top 30 Coffees of 2017.Yirgacheffe is a coffee region in southern Ethiopia that produces distinctive coffees from traditional varieties of Arabica long grown in the region. This is a natural or dry-processed version, meaning the beans were dried inside the fruit, encouraging a flavor profile that is less predictable and deeper than the more familiar wet-processed floral- and citrus-toned Yirgacheffe profile. Like virtually all southern Ethiopia coffees, this coffee is produced by villagers on small, garden plots interplanted with food and other subsistence crops. Espresso Republic, founded in 2010, specializes in sourcing quality coffees and roasting them in small batches for both retail and wholesale customers. Visit www.espressorepublic.com for more information.",
    "The Bottom Line": "A thrill of a natural-processed Ethiopia"
  },
  {
    "title": "Bourbon-Barrel-Aged Kenya Baragu",
    "review title": "Modern Times Coffee",
    "review rating": "94",
    "Location": "San Diego, California",
    "Origin": "Central Kenya",
    "Roast": "Medium-Light",
    "Est. Price": "$20.00/8 ounces",
    "Review Date": "May 2017",
    "Agtron": "55/76",
    "Aroma": "9",
    "Acidity": "9",
    "Body": "9",
    "Flavor": "9",
    "Aftertaste": "8",
    "Blind Assessment": "Deeply sweet with a resonantly savory edge; intense and original. Peach, lavender, coconut and oak are complicated by a pleasing alcohol suggestion that no doubt reflects the bourbon-barrel conditioning, but in the sensory context of the coffee reads more brandy- or wine-like. Round, vibrant acidity; satiny mouthfeel. The peach note in particular carries into a flavor-saturated finish.",
    "Notes": "This exceptional coffee was selected as the No. 25 coffee on Coffee Reviews list of the Top 30 Coffees of 2017.Before roasting, this distinguished Kenya coffee was held for 65 days in barrels previously used to age bourbon whiskey. This coffee tied for the highest rating in a cupping of aged, casked and specially cured coffees forCoffee Reviews May 2017 tasting report.Modern Times is a well-loved, exuberantly inventive Point Loma, San Diego brewery that has long specialized in coffee-beer crossovers and overlaps. Visit www.moderntimescoffee.com for more information.",
    "The Bottom Line": "A resonant, complexly layered, quite original cup.",
    "This review originally appeared in the May, 2017 tasting report": "Aged, Casked and Cured"
  },
  {
    "title": "Uganda Fair Trade Bukonzo",
    "review title": "Conscious Cup Coffee Roasters",
    "review rating": "93",
    "Location": "Crystal Lake, Illinois",
    "Origin": "Rwenzori Mountains, western Uganda",
    "Roast": "Medium-Light",
    "Est. Price": "$19.75/16 ounces",
    "Review Date": "September 2017",
    "Agtron": "51/78",
    "Aroma": "8",
    "Acidity/Structure": "9",
    "Body": "9",
    "Flavor": "9",
    "Aftertaste": "8",
    "Blind Assessment": "Zesty but deeply and resonantly nut-toned. Roasted cashew, oak, apricot, orange zest, magnolia-like flowers in aroma and cup. Zesty yet sweet, almost sugary, in structure, with a savory hint. Plush, lightly syrupy mouthfeel. Fruit notes in particular persist in a round, resonant, quietly flavor-saturated finish.  ",
    "Notes": "This exceptional coffee was selected as the No. 26 coffee on Coffee Reviews list of the Top 30 Coffees of 2017. Produced by members of the Bakonzu tribe from trees of the SL14 and SL28 varieties of Arabica. Organic and Fair Trade certified, the latter meaning they were purchased from small-holding farmers at a fair or economically sustainable price. Conscious Cup Coffee Roasters is independent and family-owned and operated cafe and coffee roaster specializing in socially and environmentally sustainable coffees. Visit www.consciouscup.com or call 815-356-0115 for more information.",
    "The Bottom Line": "Although Uganda has struggled over the years to produce top Arabica coffees worthy of its excellent terroirs and hard-working growers, producers have clearly succeeded here with this very impressive, quite distinctive offering in the deep, resonant style of the best Central Africa coffees."
  },
  {
    "title": "Panama Geisha",
    "review title": "San Francisco Bay Coffee",
    "review rating": "94",
    "Location": "Lincoln, California",
    "Origin": "Boquete growing region, western Panama",
    "Roast": "Medium-Dark",
    "Est. Price": "$29.99/12 ounces",
    "Review Date": "September 2017",
    "Agtron": "34/52",
    "Aroma": "9",
    "Acidity/Structure": "9",
    "Body": "8",
    "Flavor": "9",
    "Aftertaste": "9",
    "Blind Assessment": "Roast-encapsulated complexity; sweetly and exhilaratingly pungent.\nRichly scorched cedar, rose-like flowers, orange zest, black sage, a hint of cocoa-ish chocolate in aroma and cup. Bittersweet but zesty in structure; light though plush mouthfeel. Flowers and cocoa in particular carry into a roasty but cleanly sweet-toned finish.",
    "Notes": "This exceptional coffee was selected as the No. 27 coffee on Coffee Reviews list of the Top 30 Coffees of 2017. It was also recognized as one of the three most exciting darker roasts of 2017. This coffee tied for the third-highest rating in a tasting of 20 coffees of the Gesha (also spelled Geisha) variety for Coffee Reviews September 2017 tasting report. With its generally elongated beans and distinctive floral and crisp, often chocolaty cup, the Gesha continues to distinguish itself as one of the worlds most unique coffees. This coffee was produced on Finca Santa Barbara, named after Barbara Rogers, Vice-President of the Rogers Family Company. San Francisco Bay is one of five coffee brands produced by the family-owned Rogers Family Company. Visit www.sanfranciscobaycoffee.com or call 800-829-1300 for more information.",
    "The Bottom Line": "Intensely sweet, intensely roasty, intensely Gesha. And given its Gesha, an impressive value.",
    "This review originally appeared in the September, 2017 tasting report": "Gesha Coffees 2017"
  },
  {
    "title": "Colombia Finca Campoalegre",
    "review title": "Durango Coffee Company",
    "review rating": "94",
    "Location": "Durango, Colorado",
    "Origin": "Pitalito, Huila Department, southern Colombia",
    "Roast": "Medium-Light",
    "Est. Price": "$12.95/12 ounces",
    "Review Date": "September 2017",
    "Agtron": "55/77",
    "Aroma": "9",
    "Acidity/Structure": "9",
    "Body": "9",
    "Flavor": "9",
    "Aftertaste": "8",
    "Blind Assessment": "Brightly sweet-savory, richly layered. Narcissus, roasted cacao nib, dried apricot, sandalwood, maple syrup in aroma and cup. Juicy, lively acidity; deeply sweet structure with savory undertones. Plush, syrupy mouthfeel. The long, resonant finish consolidates to attractive floral and cocoa tones.",
    "Notes": "This exceptional coffee was selected as the No. 28 coffee on Coffee Reviews list of the Top 30 Coffees of 2017. Produced by Ivan Quinayas at Finca Campoalegre from trees of the Caturra and Colombia varieties of Arabica. This is a wet-processed or washed coffee, meaning the fruit skin and pulp were removed from the beans immediately after harvesting and before drying. Located in southwestern Colorado, Durango Coffee lays claim to a rich coffee history that dates to 1986. Its motto is Tough Town, Great Coffee. Visit www.durangocoffee.com or call 800-748-2275 for more information.",
    "The Bottom Line": "A nuanced, complex Colombia cup that leads with lush floral notes and stone fruit grounded by suggestions of rich cocoa."
  },
  {
    "title": "Peru Cajamarca Organic",
    "review title": "Black Coffee Roasting",
    "review rating": "93",
    "Location": "Missoula, Montana",
    "Origin": "Cajamarca growing region, Peru",
    "Roast": "Medium-Dark",
    "Est. Price": "$15.50/12 ounces",
    "Review Date": "August 2017",
    "Agtron": "45/55",
    "Aroma": "9",
    "Acidity/Structure": "8",
    "Body": "9",
    "Flavor": "9",
    "Aftertaste": "8",
    "Blind Assessment": "Quiet, complete; complexly chocolate- and fruit-toned. Dark chocolate, ripe black cherry, coconut, cashew, complex flowers (lavender, honeysuckle) in aroma and cup. The structure is sweetly juicy with a slight, deepening bitter edge. Light but satiny, lively mouthfeel. Drying though sweet finish, saturated with chocolate and flowers.  ",
    "Notes": "This exceptional coffee was selected as the No. 29 coffee on Coffee Reviews list of the Top 30 Coffees of 2017. Certified organically grown, and processed by the traditional wet or washed method, in which skin and fruit flesh are removed from the beans or seeds before they are dried. This coffee tied for the third-highest rating in a tasting of nearly 130 darker-roasted coffees for Coffee Reviews August 2017 tasting report. Black Coffee Roasting is a small-batch craft roaster focusing on organic coffees only and sustainable packaging and business practices. For further information visit www.blackcoffeeroastingco.com or call 406-541-3700.",
    "The Bottom Line": "Quiet, elegant Peru, with chocolate and ripe fruit notes rounded and deepened by a very tactful, backgrounded medium-dark roast.",
    "This review originally appeared in the August, 2017 tasting report": "Darker-Roasted Coffees"
  },
  {
    "title": "Rwanda Twongere Umusaruro",
    "review title": "Question Coffee",
    "review rating": "93",
    "Location": "Kigali, Rwanda",
    "Origin": "Rukara, Eastern Province, Rwanda",
    "Roast": "Medium-Light",
    "Est. Price": "$13.99/12 ounces",
    "Review Date": "June 2017",
    "Agtron": "54/76",
    "Aroma": "9",
    "Acidity": "8",
    "Body": "8",
    "Flavor": "9",
    "Aftertaste": "9",
    "Blind Assessment": "Sweetly pungent, rich-toned, savory. Peach, violet, pistachio, molasses, thyme in aroma and cup. Gentle, backgrounded acidity; syrupy, lean though smooth mouthfeel. The resonant finish is long, leading with attractive floral top notes, followed by hints of stone fruit, finally rounding to cocoa and herb tones in the very long.",
    "Notes": "This exceptional coffee was selected as the No. 30 coffee on Coffee Reviews list of the Top 30 Coffees of 2017. Since 2013, this womens cooperative has received training in agronomy, market access, and quality control from Sustainable Harvest Rwanda, by way of a grant from Bloomberg Philanthropies. Twongere Umusaruro means increase production; in the last two years, these farmers have nearly doubled their incomes and their yield per coffee tree. Processed by the conventional wet or washed method, in which skin and fruit flesh are removed from the beans or seeds before they are dried. This coffee tied for the third-highest rating in a tasting of women-produced coffees for Coffee Reviews June 2017 tasting report. Question Coffee, based in Kigali Rwanda with roasting carried out by Nossa Familia in Portland, Oregon, was founded in 2015 to improve the lives of farmers and promote gender equality in coffee-growing organizations. This coffee was made possible by the Relationship Coffee Institute (Sustainable Harvests sister organization, and the NGO behind Question Coffee). Visit www.questioncoffee.com for more information.",
    "The Bottom Line": "A complex Rwanda cup that rewards patience with an unfolding of sweet fruit and floral notes juxtaposed with suggestions of savory herbs.",
    "This review originally appeared in the June, 2017 tasting report": "Holding Up (More Than) Half The Sky"
  }
]